arribada/linkit-v4-core/ports/nrf52840/core/interface/ble_interface.cpp
#include "ble_interface.hpp"

#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_qwr.h"
#include "app_timer.h"
#include "nrf_log.h"
#include "ble_stm_ota.h"
#include "error.hpp"
#include "debug.hpp"
#include "timer.hpp"


#define APP_BLE_CONN_CFG_TAG 1 /**< A tag identifying the SoftDevice BLE configuration. */

#define DEVICE_NAME          "<unknown>" /**< Name of device. Will be included in the advertising data. */
#define NUS_SERVICE_UUID_TYPE \
	BLE_UUID_TYPE_VENDOR_BEGIN /**< UUID type for the Nordic UART Service (vendor specific). */
#define STM_OTA_SERVICE_UUID_TYPE \
	BLE_UUID_TYPE_VENDOR_BEGIN /**< UUID type for the STM OTA Service (vendor specific). */

#define APP_BLE_OBSERVER_PRIO 3 /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define APP_ADV_INTERVAL 64 /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */

#define APP_ADV_DURATION BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED /**< The advertising duration */

#define MIN_CONN_INTERVAL \
	MSEC_TO_UNITS(        \
	    20,               \
	    UNIT_1_25_MS) /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL \
	MSEC_TO_UNITS(        \
	    400,              \
	    UNIT_1_25_MS)   /**< Maximum acceptable connection interval (400 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY 0 /**< Slave latency. */
#define CONN_SUP_TIMEOUT \
	MSEC_TO_UNITS(       \
	    4000, UNIT_10_MS) /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY \
	APP_TIMER_TICKS(                   \
	    5000) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY \
	APP_TIMER_TICKS(                  \
	    30000) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT 3 /**< Number of attempts before giving up the connection parameter negotiation. */

#define TRANSFER_TIMEOUT             10000 /** 10 seconds transfer timeout */

/**< BLE NUS service instance. */
// These next few lines are equivalent to BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT) but is necessary for C++ compilation
BLE_LINK_CTX_MANAGER_DEF(m_nus_link_ctx_storage, (1), sizeof(ble_nus_client_context_t));
static ble_nus_t m_nus = {
	.uuid_type = 0,
	.service_handle = 0,
	.tx_handles = { 0, 0, 0, 0 },
	.rx_handles = { 0, 0, 0, 0 },
	.p_link_ctx_storage = &m_nus_link_ctx_storage,
	.data_handler = nullptr,
};
NRF_SDH_BLE_OBSERVER(m_nus_obs, BLE_NUS_BLE_OBSERVER_PRIO, ble_nus_on_ble_evt, &m_nus);

BLE_STM_OTA_DEF(m_stm_ota);

NRF_BLE_GATT_DEF(m_gatt);           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising); /**< Advertising module instance. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */
static uint16_t m_ble_nus_max_data_len =
    BLE_GATT_ATT_MTU_DEFAULT
    - 3; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[] = /**< Universally unique service identifier. */
    {
	    { BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE },
    };

extern Timer *system_timer;


void BleInterface::init() {
	m_carriage_return_received = false;
	m_receive_buffer_len = 0;
	m_is_first_ota_packet = false;

	ble_stack_init();
	gap_params_init();
	gatt_init();
	services_init();
}

void BleInterface::start(std::function<int(BLEServiceEvent &event)> on_event) {
	m_on_event = on_event;
}

void BleInterface::stop() {
	advertising_stop();

	// Disconnect if we were connected
	if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
		NRF_LOG_DEBUG("Disconnecting...");

		ret_code_t err_code;
		err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

		if (err_code != NRF_SUCCESS) NRF_LOG_ERROR("sd_ble_gap_disconnect() failed: 0x%08lX", err_code);
	}

	// Discard any received data
	m_carriage_return_received = false;
	m_receive_buffer_len = 0;
	m_is_first_ota_packet = false;

	// Deregister the owning state's callback. It was posted by start() and,
	// until now, NEVER cleared — so ConfigurationState's handler stayed live
	// for the rest of the device's life. Any later connection re-entered it
	// from OperationalState, where it re-armed the 20-minute BLE inactivity
	// timer (which then forced Operational -> PreOperational -> Operational,
	// seen in the field on 2026-08-24 08:35:07), hijacked the DTE async writer
	// onto BLE, and drove the configuration LED states. The interface's own
	// housekeeping (m_conn_handle, RX buffers) runs before this dispatch in
	// ble_evt_handler, so dropping the callback here loses nothing.
	m_on_event = nullptr;
}

std::string BleInterface::read_line() {
	if (m_carriage_return_received && m_receive_buffer_len) {
		std::string str((char *)m_receive_buffer, m_receive_buffer_len);
		m_receive_buffer_len = 0;
		m_carriage_return_received = false;
		return str;
	}

	return std::string();
}

void BleInterface::set_device_name(const std::string &name) {
	ret_code_t err_code;
	ble_gap_conn_sec_mode_t sec_mode;

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
	err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)name.c_str(), name.size());
	APP_ERROR_CHECK(err_code);

	// Setup advertising parameters
	advertising_stop();
	advertising_init();
	advertising_start();
}

bool BleInterface::write_best_effort(std::string str) {
	uint8_t *buffer = reinterpret_cast<uint8_t *>(const_cast<char *>(str.c_str()));
	size_t length = str.length();
	while (length) {
		uint16_t transfer_length = std::min(length, static_cast<size_t>(BLE_NUS_MAX_DATA_LEN));
		uint32_t err = ble_nus_data_send(&m_nus, buffer, &transfer_length, m_conn_handle);
		if (err == NRF_SUCCESS) {
			length -= transfer_length;
			buffer += transfer_length;
		} else {
			return false;  // Drop remaining data — no retry, no blocking
		}
	}
	return true;
}

bool BleInterface::write(std::string str) {
	uint32_t err_code;

