arribada/linkit-v4-core/ports/nrf52840/core/interface/ble_interface.cpp
	size_t length = str.length();

	// WARN: Unfortunately the ble_nus_data_send() library incorrectly requires a non-const data pointer
	// By examining the code we can see this is incorrect and at least for SDK v17.0.2 it is safe to cast away the const
	uint8_t *buffer = reinterpret_cast<uint8_t *>(const_cast<char *>(str.c_str()));

	// Record start time of send
	uint64_t start_t = system_timer->get_counter();

	do {
		uint16_t transfer_length = std::min(length, static_cast<size_t>(BLE_NUS_MAX_DATA_LEN));

		// WARN: Unfortunately the ble_nus_data_send() library incorrectly requires a non-const data pointer
		// By examining the code we can see this is incorrect and at least for SDK v17.0.2 it is safe to cast away the const
		err_code = ble_nus_data_send(&m_nus, buffer, &transfer_length, m_conn_handle);
		if (err_code != NRF_ERROR_RESOURCES && err_code != NRF_SUCCESS) {
			//DEBUG_ERROR("BleInterface::write: error_code=%08x", err_code);
			return false;
		}

		if (err_code == NRF_SUCCESS) {
			length -= transfer_length;
			buffer += transfer_length;
		}

		//DEBUG_TRACE("BleInterface::write: error_code=%08x remaining=%u", err_code, (unsigned int)length);

		// Check for timeout
		if (length && (system_timer->get_counter() - start_t) >= TRANSFER_TIMEOUT) return false;

	} while (length);

	return true;
}

void BleInterface::ble_stack_init() {
	ret_code_t err_code;
	err_code = nrf_sdh_enable_request();
	APP_ERROR_CHECK(err_code);

	// Configure the BLE stack using the default settings.
	// Fetch the start address of the application RAM.
	uint32_t ram_start = 0;
	err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
	APP_ERROR_CHECK(err_code);

	// Enable BLE stack.
	err_code = nrf_sdh_ble_enable(&ram_start);
	APP_ERROR_CHECK(err_code);

	// Register a handler for BLE events.
	NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, static_ble_evt_handler, NULL);
}

void BleInterface::gap_params_init() {
	uint32_t err_code;
	ble_gap_conn_params_t gap_conn_params;
	ble_gap_conn_sec_mode_t sec_mode;

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
	err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)DEVICE_NAME, strlen(DEVICE_NAME));
	APP_ERROR_CHECK(err_code);

	memset(&gap_conn_params, 0, sizeof(gap_conn_params));

	gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
	gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
	gap_conn_params.slave_latency = SLAVE_LATENCY;
	gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

	err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
	APP_ERROR_CHECK(err_code);
}

void BleInterface::gatt_init() {
	ret_code_t err_code;

	err_code = nrf_ble_gatt_init(&m_gatt, static_gatt_evt_handler);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
	APP_ERROR_CHECK(err_code);
}

void BleInterface::services_init() {
	uint32_t err_code;
	ble_nus_init_t nus_init;
	ble_stm_ota_init_t stm_ota_init;
	nrf_ble_qwr_init_t qwr_init = { 0 };

	// Initialize Queued Write Module.
	qwr_init.error_handler = static_nrf_qwr_error_handler;

	err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
	APP_ERROR_CHECK(err_code);

	// Initialize NUS.
	memset(&nus_init, 0, sizeof(nus_init));

	nus_init.data_handler = static_nus_data_handler;

	err_code = ble_nus_init(&m_nus, &nus_init);
	APP_ERROR_CHECK(err_code);

	// Initialize STM OTA.
	memset(&m_stm_ota, 0, sizeof(m_stm_ota));

	stm_ota_init.event_handler = static_stm_ota_data_handler;

	err_code = ble_stm_ota_init(&m_stm_ota, &stm_ota_init);
	APP_ERROR_CHECK(err_code);
}

void BleInterface::advertising_init() {
	uint32_t err_code;
	ble_advertising_init_t init;

	memset(&init, 0, sizeof(init));

	init.advdata.name_type = BLE_ADVDATA_FULL_NAME;
	init.advdata.include_appearance = false;
	init.advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

	init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
	init.srdata.uuids_complete.p_uuids = m_adv_uuids;

	init.config.ble_adv_fast_enabled = true;
	init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
	init.config.ble_adv_fast_timeout = APP_ADV_DURATION;
	// The SDK module restarts advertising all by itself on
	// BLE_GAP_EVT_DISCONNECTED (on_disconnected -> ble_advertising_start).
	// Because the disconnection requested by stop() is ASYNCHRONOUS, that event
	// arrives AFTER we have left configuration mode: the beacon would start
	// transmitting again indefinitely (APP_ADV_DURATION = UNLIMITED). We cut
	// this implicit restart and redo it EXPLICITLY in our own handler, only if
	// advertising is still wanted.
	init.config.ble_adv_on_disconnect_disabled = true;
	init.evt_handler = static_on_adv_evt;

	DEBUG_TRACE("ble_advertising_init");
	err_code = ble_advertising_init(&m_advertising, &init);
	APP_ERROR_CHECK(err_code);

	ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

#ifdef BENCH_TEST
/// @brief Bench: is advertising wanted, and which mode does the SDK module believe is active?
bool BleInterface::bench_is_advertising() {
	// OUR intention only. Do not mix adv_mode_current into it: that field stays
	// stuck on FAST after sd_ble_gap_adv_stop(), so an AND/OR with it always
	// yields a positive verdict — a gauge unable to observe a stop, one that
	// declared the fix a failure while it was in fact working.
	return m_advertising_wanted;
}

int BleInterface::bench_adv_mode() {
	return (int)m_advertising.adv_mode_current;
}

unsigned int BleInterface::bench_probe_advertising() {
	// The only authoritative measurement: we ask the SoftDevice to stop.
	// NRF_SUCCESS -> it really was advertising; NRF_ERROR_INVALID_STATE -> it was not.
	return (unsigned int)sd_ble_gap_adv_stop(m_advertising.adv_handle);
}

/// @brief Bench: replays the BLE disconnection without a phone.
/// It is THIS sequence that left the beacon advertising permanently: stop()
/// requests the disconnection, the event arrives after we have left config mode,
/// and the SDK module restarted advertising. We reproduce it identically here by
/// passing the event to the SDK module and then to our own handler.
void BleInterface::bench_inject_disconnect() {
	ble_evt_t evt;
	memset(&evt, 0, sizeof(evt));
	evt.header.evt_id = BLE_GAP_EVT_DISCONNECTED;
	evt.evt.gap_evt.conn_handle = m_advertising.current_slave_link_conn_handle;
	evt.evt.gap_evt.params.disconnected.reason = BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION;
	ble_advertising_on_ble_evt(&evt, &m_advertising);
	ble_evt_handler(&evt, nullptr);
}
#endif

