arribada/linkit-v4-core/ports/nrf52840/core/interface/ble_interface.cpp
void BleInterface::advertising_start() {
	m_advertising_wanted = true;
	uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
	// No APP_ERROR_CHECK here: it causes a FULL RESET of the beacon. Yet the
	// most likely error is NRF_ERROR_INVALID_STATE (advertising already
	// active), which is perfectly benign. Rebooting a sealed device out on a
	// mission for that would be worse than the problem.
	if (err_code != NRF_SUCCESS)
		DEBUG_ERROR("BleInterface::advertising_start: ble_advertising_start=0x%08lX", (unsigned long)err_code);
}

void BleInterface::advertising_stop() {
	m_advertising_wanted = false;
	uint32_t err_code = sd_ble_gap_adv_stop(m_advertising.adv_handle);
	// NRF_ERROR_INVALID_STATE = we were not advertising: normal, we say nothing.
	// The return code used to be completely ignored, so a real failure went
	// unnoticed even though it leaves the radio powered on.
	if (err_code != NRF_SUCCESS && err_code != NRF_ERROR_INVALID_STATE)
		DEBUG_ERROR("BleInterface::advertising_stop: sd_ble_gap_adv_stop=0x%08lX", (unsigned long)err_code);
}

void BleInterface::ble_evt_handler(ble_evt_t const *p_ble_evt, void *p_context) {
	uint32_t err_code;

	switch (p_ble_evt->header.evt_id) {
	case BLE_GAP_EVT_CONNECTED:
		NRF_LOG_INFO("Connected");
		//err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
		//APP_ERROR_CHECK(err_code);
		m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
		err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
		APP_ERROR_CHECK(err_code);
		if (m_on_event) {
			BLEServiceEvent e;
			e.event_type = BLEServiceEventType::CONNECTED;
			(void)m_on_event(e);
		}
		break;

	case BLE_GAP_EVT_DISCONNECTED:
		NRF_LOG_INFO("Disconnected for reason 0x%02X", p_ble_evt->evt.gap_evt.params.disconnected.reason);
		// LED indication will be changed when advertising starts.
		m_conn_handle = BLE_CONN_HANDLE_INVALID;

		// Discard any received data
		m_carriage_return_received = false;
		m_receive_buffer_len = 0;
		m_is_first_ota_packet = false;

		if (m_on_event) {
			BLEServiceEvent e;
			e.event_type = BLEServiceEventType::DISCONNECTED;
			(void)m_on_event(e);
		}
		// Explicit restart (the SDK no longer does it, cf. advertising_init):
		// in configuration mode, a phone that disconnects must be able to
		// reconnect; after a stop(), the radio must stay off.
		if (m_advertising_wanted) advertising_start();
		break;

	case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
		NRF_LOG_DEBUG("PHY update request.");
		ble_gap_phys_t const phys = {
			.tx_phys = BLE_GAP_PHY_AUTO,
			.rx_phys = BLE_GAP_PHY_AUTO,
		};
		err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
		APP_ERROR_CHECK(err_code);
	} break;

	case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
		// Pairing not supported
		err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTS_EVT_SYS_ATTR_MISSING:
		// No system attributes have been stored.
		err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTC_EVT_TIMEOUT:
		// Disconnect on GATT Client timeout event.
		err_code =
		    sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTS_EVT_TIMEOUT:
		// Disconnect on GATT Server timeout event.
		err_code =
		    sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break;

	default:
		// No implementation needed.
		break;
	}
}

/**@brief Function for handling events from the GATT library. */
void BleInterface::gatt_evt_handler(nrf_ble_gatt_t *p_gatt, nrf_ble_gatt_evt_t const *p_evt) {
	if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)) {
		m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
		NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len);
	}
	NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x", p_gatt->att_mtu_desired_central,
	              p_gatt->att_mtu_desired_periph);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
void BleInterface::nrf_qwr_error_handler(uint32_t nrf_error) {
	APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the events from the STM OTA BLE Service.
 *
 * @details This function will process the events received from the STM OTA BLE Service
 *
 * @param[in] p_evt       STM OTA Service event.
 */
/**@snippet [Handling the data received over BLE] */
void BleInterface::stm_ota_event_handler(uint16_t conn_handle, ble_stm_ota_t *p_stm_ota, ble_stm_ota_event_t *p_evt) {
	// No owner registered — bail out before touching m_on_event.
	//
	// This runs in SoftDevice interrupt context, reached through the plain-C
	// frames of ble_stm_ota.c. Those frames are EXIDX_CANTUNWIND, so an
	// exception thrown below cannot unwind through them and lands straight in
	// std::terminate. Every m_on_event() call further down is either bare or
	// wrapped in `catch (ErrorCode)`, which does NOT catch the
	// std::bad_function_call that an empty std::function throws.
	//
	// Before stop() started clearing m_on_event this could not happen: the
	// callback was set for the lifetime of the device. Now it can — a reed
	// swipe out of configuration while a phone still has OTA writes in flight
	// leaves a few hundred ms during which queued write-without-response
	// packets still arrive. Reply "interrupted" so the peer fails cleanly.
	if (!m_on_event) {
		uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE, STM_OTA_STATUS_IGNORE };
		ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
		return;
	}

