arribada/linkit-v4-core/ports/nrf52840/core/interface/ble_interface.cpp
	BLEServiceEvent s_evt;
	switch (p_evt->event_type) {
	case STM_OTA_EVENT_ACTION: {
		if (p_evt->action == STM_OTA_ACTION_START_WIRELESS || p_evt->action == STM_OTA_ACTION_START_USER_APP) {
			// The next receive raw data packet will contain at least 8 bytes
			// which shall include the total file size and a CRC32 checksum
			m_is_first_ota_packet = true;
			m_ota_file_id = p_evt->address;  // Record file ID

			// Send handshake back to client to inform them that we receive their
			// start request
			uint8_t status[3] = { STM_OTA_STATUS_IGNORE, STM_OTA_STATUS_IGNORE, STM_OTA_STATUS_START_UPLOAD_OK };
			ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
		} else if (p_evt->action == STM_OTA_ACTION_STOP_ALL || p_evt->action == STM_OTA_ACTION_CANCEL) {
			s_evt.event_type = BLEServiceEventType::OTA_ABORT;
			m_on_event(s_evt);
			uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE,
			                      STM_OTA_STATUS_IGNORE };
			ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
		} else if (p_evt->action == STM_OTA_ACTION_UPLOAD_FINISHED) {
			s_evt.event_type = BLEServiceEventType::OTA_END;
			try {
				m_on_event(s_evt);
				uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_OK, STM_OTA_STATUS_INTEGRITY_OK,
				                      STM_OTA_STATUS_IGNORE };
				ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
			} catch (ErrorCode e) {
				DEBUG_TRACE("OTA_END: Got error: %u", e);
				if (OTA_TRANSFER_CRC_ERROR == e) {
					uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_OK, STM_OTA_STATUS_INTEGRITY_NOT_OK,
					                      STM_OTA_STATUS_IGNORE };
					ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
					break;
				} else {
					uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE,
					                      STM_OTA_STATUS_IGNORE };
					ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
				}
			}
		}
	} break;
	case STM_OTA_EVENT_RAW_DATA: {
		if (m_is_first_ota_packet) {
			// If the length is less than 8 bytes then flag an error
			if (p_evt->length < 8) {
				uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE,
				                      STM_OTA_STATUS_IGNORE };
				ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
				return;
			}

			m_is_first_ota_packet = false;

			// Debug: print first 16 bytes of OTA packet
			DEBUG_TRACE("OTA first packet (%u bytes): %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X "
			            "%02X %02X %02X",
			            p_evt->length, p_evt->length > 0 ? ((uint8_t *)p_evt->p_data)[0] : 0,
			            p_evt->length > 1 ? ((uint8_t *)p_evt->p_data)[1] : 0,
			            p_evt->length > 2 ? ((uint8_t *)p_evt->p_data)[2] : 0,
			            p_evt->length > 3 ? ((uint8_t *)p_evt->p_data)[3] : 0,
			            p_evt->length > 4 ? ((uint8_t *)p_evt->p_data)[4] : 0,
			            p_evt->length > 5 ? ((uint8_t *)p_evt->p_data)[5] : 0,
			            p_evt->length > 6 ? ((uint8_t *)p_evt->p_data)[6] : 0,
			            p_evt->length > 7 ? ((uint8_t *)p_evt->p_data)[7] : 0,
			            p_evt->length > 8 ? ((uint8_t *)p_evt->p_data)[8] : 0,
			            p_evt->length > 9 ? ((uint8_t *)p_evt->p_data)[9] : 0,
			            p_evt->length > 10 ? ((uint8_t *)p_evt->p_data)[10] : 0,
			            p_evt->length > 11 ? ((uint8_t *)p_evt->p_data)[11] : 0,
			            p_evt->length > 12 ? ((uint8_t *)p_evt->p_data)[12] : 0,
			            p_evt->length > 13 ? ((uint8_t *)p_evt->p_data)[13] : 0,
			            p_evt->length > 14 ? ((uint8_t *)p_evt->p_data)[14] : 0,
			            p_evt->length > 15 ? ((uint8_t *)p_evt->p_data)[15] : 0);

			s_evt.event_type = BLEServiceEventType::OTA_START;
			s_evt.file_id = m_ota_file_id;
			s_evt.file_size = ((uint8_t *)p_evt->p_data)[3] | ((uint8_t *)p_evt->p_data)[2] << 8
			                  | ((uint8_t *)p_evt->p_data)[1] << 16 | ((uint8_t *)p_evt->p_data)[0] << 24;
			s_evt.crc32 = ((uint8_t *)p_evt->p_data)[7] | ((uint8_t *)p_evt->p_data)[6] << 8
			              | ((uint8_t *)p_evt->p_data)[5] << 16 | ((uint8_t *)p_evt->p_data)[4] << 24;

			// Notify start event
			try {
				m_on_event(s_evt);
			} catch (ErrorCode e) {
				// Exception raised, indicate the procedure failed
				DEBUG_TRACE("OTA_FILE_DATA: Got error: %u", e);
				uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE,
				                      STM_OTA_STATUS_IGNORE };
				ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
			}

			// If any bytes remain then pass these on as file data
			if (p_evt->length > 8) {
				s_evt.event_type = BLEServiceEventType::OTA_FILE_DATA;
				s_evt.data = (uint8_t *)p_evt->p_data + 8;
				s_evt.length = p_evt->length - 8;

				// Notify file data
				try {
					m_on_event(s_evt);
				} catch (ErrorCode e) {
					// Exception raised, indicate the procedure failed
					DEBUG_TRACE("OTA_FILE_DATA: Got error: %u", e);
					uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE,
					                      STM_OTA_STATUS_IGNORE };
					ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
				}
			}
		} else {
			s_evt.event_type = BLEServiceEventType::OTA_FILE_DATA;
			s_evt.data = p_evt->p_data;
			s_evt.length = p_evt->length;

			try {
				m_on_event(s_evt);
			} catch (ErrorCode e) {
				// Exception raised, indicate the procedure failed
				DEBUG_TRACE("OTA_FILE_DATA: Got error: %u", e);
				uint8_t status[3] = { STM_OTA_STATUS_FILE_RECEPTION_INTERRUPTED, STM_OTA_STATUS_IGNORE,
				                      STM_OTA_STATUS_IGNORE };
				ble_stm_ota_on_file_upload_status(conn_handle, p_stm_ota, status);
			}
		}
	} break;
	default: break;
	}
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
void BleInterface::nus_data_handler(ble_nus_evt_t *p_evt) {
	if (p_evt->type == BLE_NUS_EVT_RX_DATA) {
		if (!m_carriage_return_received) {
			// If receiving this data would overrun our buffer then we need to discard what we already have to prevent the buffer from filling and not being cleared
			if (m_receive_buffer_len + p_evt->params.rx_data.length > sizeof(m_receive_buffer))
				m_receive_buffer_len = 0;

			if (p_evt->params.rx_data.length > sizeof(m_receive_buffer)) {
				DEBUG_WARN("BleInterface::nus_data_handler: received data from BLE NUS larger than buffer.");
			} else {
				memcpy(&m_receive_buffer[m_receive_buffer_len], p_evt->params.rx_data.p_data,
				       p_evt->params.rx_data.length);
				m_receive_buffer_len = m_receive_buffer_len + p_evt->params.rx_data.length;
				DEBUG_TRACE("BleInterface::nus_data_handler: received %u bytes cumulative %u (%03x).",
				            p_evt->params.rx_data.length, m_receive_buffer_len, m_receive_buffer_len);
				if (m_receive_buffer_len > 0 && m_receive_buffer[m_receive_buffer_len - 1] == '\r')
					m_carriage_return_received = true;

				// Notify the user that we have a string waiting to be read with readline()
				// only if end line is received
				if (m_on_event && m_carriage_return_received) {
					BLEServiceEvent e;
					e.event_type = BLEServiceEventType::DTE_DATA_RECEIVED;
					(void)m_on_event(e);
				}
			}
		} else {
			DEBUG_WARN("BleInterface::nus_data_handler: Received data from BLE NUS. But discarded as buffer already "
			           "contains a string.");
		}

